{"id":207,"date":"2020-06-05T09:14:26","date_gmt":"2020-06-05T09:14:26","guid":{"rendered":"https:\/\/www.rcl.ac.uk\/?page_id=207"},"modified":"2021-02-23T15:42:40","modified_gmt":"2021-02-23T15:42:40","slug":"governance-and-external-expertise","status":"publish","type":"page","link":"https:\/\/www.rcl.ac.uk\/our-college\/governance-and-external-expertise\/","title":{"rendered":"Governance and External Expertise"},"content":{"rendered":"<div id=\"static-page-header-block_5efdf7beeb2ee\" class=\"web-block static-page-header\" style=\"background-color: #a6093d;\">\n            <div class=\"static-page-header__background-image-wrap\">\n                        <img width=\"1400\" height=\"933\" src=\"https:\/\/www.rcl.ac.uk\/wp-content\/uploads\/2020\/07\/AboutUs-OurExpertise-RLCPhoto455-1400x933.jpg\" class=\"static-page-header__background-image\" alt=\"\" srcset=\"https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/07\/AboutUs-OurExpertise-RLCPhoto455-1400x933.jpg 1400w,  https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/07\/AboutUs-OurExpertise-RLCPhoto455-768x512.jpg 768w,  https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/07\/AboutUs-OurExpertise-RLCPhoto455-991x661.jpg 991w,  https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/07\/AboutUs-OurExpertise-RLCPhoto455-150x100.jpg 150w,  https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/07\/AboutUs-OurExpertise-RLCPhoto455-576x384.jpg 576w,  https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/07\/AboutUs-OurExpertise-RLCPhoto455-992x661.jpg 992w,  https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2020\/07\/AboutUs-OurExpertise-RLCPhoto455-1200x800.jpg 1200w\" sizes=\"(max-width: 1400px) 100vw, 1400px\" \/>\n                  <\/div>\n        <div class=\"static-page-header__inner\">\n\n        <div class=\"static-page-header__content-wrap\">\n            \n                            <p class=\"web-block static-page-header__breadcrumb\"><span><span><a href=\"https:\/\/www.rcl.ac.uk\/\">Home<\/a><\/span><\/p>\n            \n            \n            <h1 class=\"static-page-header__heading\">Governance and External Expertise<\/h1>\n\n            \n            <p class=\"static-page-header__introduction\"><\/p>\n\n            \n                    <\/div>\n    <\/div>\n<\/div>\n\n\n<div id=\"general-content-block_5eeb3ea46a36f\" class=\"web-block general-content\">\n\n\n\n\n\n\n\n\n\t    <div class=\"rich-text top-row\">\n\t\t\t\t\n\t\t\t\t\t            \t<h3>Governance and external expertise<\/h3>\n\t\t\t\t\t    <\/div>\n\n\n\n\n\n\n\n\t\t<div class=\"bottom-row  bottom-row--have-sidebar\">\n\t        <div class=\"bottom-row__inner rich-text\"><h6><\/h6>\n<h6>Governance<\/h6>\n<p>The Board of Governors of Regent College London are the College’s directors, Dr Selva Pankaj, Mrs Tharshiny Pankaj, Dr Maurizio Bragagni and Mr Simon Blagden CBE. Dr Selva Pankaj also acts as the College Principal.<\/p>\n<p>The Board of Governors holds ultimate responsibility for the management of all aspects of the operation of Regent College London. The Board of Governors has three sub-committees reporting into it: the Audit and Risk Committee, the Finance Committee and the Nominations and Remuneration Committee.<\/p>\n<h6 style=\"text-align: left;\">Dr Maurizio Bragagni, Independent Governor, Chair of the Board<\/h6>\n<p><img class=\"alignleft size-full wp-image-89071\" src=\"https:\/\/www.rcl.ac.uk\/wp-content\/uploads\/2021\/01\/Maurizio-Bragagni.png\" alt=\"Maurizio-Bragagni\" width=\"200\" height=\"200\" srcset=\"https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Maurizio-Bragagni.png 200w,   https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Maurizio-Bragagni-150x150.png 150w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/p>\n<p style=\"text-align: left;\">Dr Maurizio Bragagni is Chairman and CEO of Tratos UK Ltd. Tratos is an innovative international cable producer with factories in the UK and Italy, offices in five continents and customers worldwide, servicing the power, transport, shipping, communications and oil and gas industries. With turnover in excess of €350 million, it is one of the world’s largest independent cable manufacturers and is involved in many high-profile and technologically- advanced projects across the globe. In April 2019, Tratos UK won a Queen’s Award for Enterprise in recognition of its innovative work.<\/p>\n<p>Maurizio has an Honorary Doctorate from the University of Bolton, a degree in Law from the University of Pisa and an MBA from London’s Cass Business School and has been responsible for exponential growth at the company, winning government funding and investing heavily in facilities, employee development and technology.<\/p>\n<p>In addition to his successful business career, Maurizio is also an active supporter of the Conservative Party in the UK and in 2018 ran for a Senate position in the Italian national elections, with a remit to represent Italians living and working abroad. Maurizio is the Honorary Consul of the Republic of San Marino in the UK &amp; Northern Ireland. This significant role in representing the state has official relations at the diplomatic level with Britain, across political and economic relations and social and cultural affairs internationally. Maurizio is also a member of the IEC Market Strategy Board offering his vision for innovation and willingness to contribute to the mission of the MSB and IEC.<\/p>\n<p>He is passionate about technological innovation and has campaigned passionately for higher minimum standards to govern the materials that are used in offices, homes and public buildings. Maurizio launched the Safer Structures Campaign in 2017, in the wake of the Grenfell Tower tragedy in London, to demand regulatory intervention to improve cable standards and monitor materials used in construction.<\/p>\n<p>A devoted patron of the arts and charitable works, Maurizio founded the Esharelife Foundation in 2016 to help some of the most disadvantaged people in the world, using an online platform for artists to generate revenues for charity. Maurizio was appointed in the New Year’s Honours List a Cavaliere of Italian Republic OMRI, for services to Italy. He is Chairman and co-Founder of British Italian Conservatives and Vice Chairman of the Italian Chamber of Commerce and Industry. He is an active member of the British Cables Association, the Approved Cables Initiative, the Institute of Directors and Oil &amp; Gas UK.<\/p>\n<p>Maurizio was previously recognised with the Keynes Sraffa Award from the Italian Chamber of Commerce. He has won numerous other industry awards, including The IOD North West &amp; Isle of Man Director of the Year Award 2019; the EEF Regional Innovation Award 2018; Best Business Awards 2018 for Best Innovation; The Big Ben Award from China’s business community in 2017; and The IOD National Director of the Year in Innovation Highly Recommended 2019.<\/p>\n<h6>Simon Blagden, CBE, Independent Governor<\/h6>\n<div id=\"read141220435\" class=\"read_div\">\n<p><img class=\"alignleft size-full wp-image-89072\" src=\"https:\/\/www.rcl.ac.uk\/wp-content\/uploads\/2021\/01\/Simon-Blagden.png\" alt=\"Simon Blagden\" width=\"200\" height=\"200\" srcset=\"https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Simon-Blagden.png 200w,   https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Simon-Blagden-150x150.png 150w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/p>\n<\/div>\n<p>Simon Blagden, CBE has 30 years business experience in the IT and Telecoms industry, initially at GEC where he was an International Commercial Manager.In 1991, he joined Quante AG as UK Managing Director and then joined the Main Board in 1995 as CEO of International Operations.<br \/>\nIn 2000 he joined Spescom in Johannesburg to head up its international telecoms and IT business. In 2005, he was appointed as Non Executive Chairman of Fujitsu Telecommunications Europe, a post he held for 14 years. Simon was appointed MBE in 1997 for services to export and was appointed CBE in 2016 for services to the economy.<\/p>\n<h6 style=\"text-align: left;\">Dr Selva Pankaj, CEO and Principal<\/h6>\n<p style=\"text-align: left;\"><img class=\"alignleft size-full wp-image-89073\" src=\"https:\/\/www.rcl.ac.uk\/wp-content\/uploads\/2021\/01\/Selva-Pankaj.png\" alt=\"Dr. Selva Pankaj\" width=\"200\" height=\"200\" srcset=\"https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Selva-Pankaj.png 200w,   https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Selva-Pankaj-150x150.png 150w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/p>\n<p style=\"text-align: left;\">Dr Selva Pankaj is a Chartered Management Accountant with an MBA and FRSA. He has enjoyed a career that has spanned two sectors, spending 15 years from 1994 to 2009 in the financial investment and merchant banking sector and from 2000 till the present day working in the education sector.<\/p>\n<p style=\"text-align: left;\">His career in the investment sector has involved work at a wide variety of firms, many of them high-profile, and global firms which include Pricoa, Rockspring, Fortress with a Joint Venture relationship with Goldman Sachs and Prudential Financial Inc amongst others.<\/p>\n<div id=\"read141220435\" class=\"read_div\">\n<p style=\"text-align: left;\">In 2000, Selva launched Regent Group alongside his partner Mrs Pankaj and father Senior Selvanayagam and the group has both grown and greatly diversified in the past nineteen years.<\/p>\n<p style=\"text-align: left;\">Selva assumed responsibility as Principal, CEO and Accountable Officer of Regent College London at the beginning of AY 2019\/20 with a clear mandate to build Regent College London into a private university in the UK.<\/p>\n<h6><\/h6>\n<h6 style=\"text-align: left;\">Tharshiny Pankaj<\/h6>\n<\/div>\n<p style=\"text-align: left;\"><img class=\"alignleft size-full wp-image-89074\" src=\"https:\/\/www.rcl.ac.uk\/wp-content\/uploads\/2021\/01\/Tharshiny-Pankaj.png\" alt=\"Tharshiny Pankaj\" width=\"200\" height=\"200\" srcset=\"https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Tharshiny-Pankaj.png 200w,   https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Tharshiny-Pankaj-150x150.png 150w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/p>\n<p style=\"text-align: left;\">Tharshiny Pankaj is a graduate of Brunel University where she studied Computer Sciences. In 1998 she took the post of ICT &amp; Computing Teacher at a sixth form college. In 2000 she played a large part in the founding of Regent Independent College and has been deeply involved in the day to day running of the various businesses and been intrinsic in the growth of the Group.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<h6>Prof Nadey Hakim (Independent Governor)<\/h6>\n<p><img class=\"alignleft size-full wp-image-89075\" src=\"https:\/\/www.rcl.ac.uk\/wp-content\/uploads\/2021\/01\/Nadey-Hakim.png\" alt=\"Prof Nadey Hakim\" width=\"200\" height=\"200\" srcset=\"https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Nadey-Hakim.png 200w,   https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Nadey-Hakim-150x150.png 150w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/p>\n<p>Professor Hakim is: the President’s Envoy and Professor of Transplantation Surgery at Imperial College; Chevalier de la Legion d’Honneur; Vice President of the British Red Cross; Vice President of the International Medical Sciences Academy; Consultant Surgeon at Imperial College Healthcare NHS Trust London; Laureat de la Faculte de Medicine de Paris; Vice President of the International Medical Sciences Academy; Vice President of Conservative Health; Past President of the International College of Surgeons, Past Vice President of the Royal Society of Medicine; a Transplantation Tutor at the London School of Surgery; a Governor of the American College of Surgeons; and Membre de l’Academie Francaise de Chirurgie; and Editor in Chief of ‘International Surgery’.<\/p>\n<p>Professor Hakim’s particular interests are in kidney and pancreas transplantation and bariatric surgery. He undertook his surgical training at Guy’s Hospital and was awarded a PhD in small bowel transplantation by University College London. He has also completed a Gastrointestinal Fellowship at the Mayo Clinic and a multiorgan transplant Fellowship at the University of Minnesota.<\/p>\n<h6>Sitha Praba (Independent Governor)<\/h6>\n<h6><\/h6>\n<p><img class=\"alignleft size-full wp-image-89076\" src=\"https:\/\/www.rcl.ac.uk\/wp-content\/uploads\/2021\/01\/Sitha-Prabha.png\" alt=\"Sitha Prabha\" width=\"200\" height=\"200\" srcset=\"https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Sitha-Prabha.png 200w,   https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Sitha-Prabha-150x150.png 150w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/p>\n<p style=\"text-align: left;\">Mr Praba is an accountant by training, and is Owner and CFO of Gateford Services, a company with holdings in the retail sector.  He is also an accountant with the Tannen Group and, having completed his accountancy degree whilst working, has a good understanding of the challenges that students such as those at Regent face.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<div class=\"space20\"><\/div><\/div>\n\n\t\t\t            \t<div class=\"bottom-row__sidebar side-cards\">\n\t\t\t\t\t\t\t\t\t\t\t<a href=\"\/our-college\/our-team\/\" target=\"_self\" class=\"side-cards__card side-cards__card--seagull\">\n\t\t\t\t\t\t\t<div class=\"side-cards__card-inner\">\n\t\t\t\t\t\t\t\t<h4 class=\"side-cards__card-title\">Meet the team<\/h4>\n\t\t\t\t\t\t\t\t<p class=\"side-cards__card-cta\">\n\t\t\t\t\t\t\t\t\t<span>Meet The Team<\/span>\n\n\t\t\t                        <svg class=\"side-cards__card-cta-icon\" width=\"17\" height=\"15\">\n\t\t\t                            <use xlink:href=\"https:\/\/www.rcl.ac.uk\/wp-content\/themes\/regent-college\/dist\/images\/svg-sprites\/svgsprite.svg#sprite-arrow-link-white\"><\/use>\n\t\t\t                        <\/svg>\n\t\t\t\t\t\t\t\t<\/p>\n\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/a>\n\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\n\n\n\n\n\n\n<\/div>\n\n\n<div id=\"general-content-block_5f119ead7489f\" class=\"web-block general-content\">\n\n\n\n\n\n\n\n\n\t    <div class=\"rich-text top-row\">\n\t\t\t\t\n\t\t\t\t\t            \t<h3>Board of Governors<\/h3>\n\t\t\t\t\t    <\/div>\n\n\n\n\n\n\n\n\t\t<div class=\"bottom-row  bottom-row--have-sidebar\">\n\t        <div class=\"bottom-row__inner rich-text\"><h6>Purpose:<\/h6>\n<p>The Board shall exercise and be responsible for the exercise of all the powers and functions of the College not reserved to the shareholders by the Articles of Association or by any provision of law, including<\/p>\n<ol>\n<li>To approve the strategic vision and long-term academic and business plans and key performance indicators, and to ensure that these meet the interests of stakeholders.<\/li>\n<li>To delegate authority to the Principal, as Chief Executive Officer, for the day to day academic, corporate, financial, estate, and people management of the College and to establish and keep under regular review the policies, procedures, and limits within such management functions as shall be undertaken by and under the authority of the Principal.<\/li>\n<li>To ensure the establishment and monitoring of systems of control and accountability, including financial and operational controls, risk assessment, and internal and external audit including procedures for handling internal grievances and conflicts of interest.<\/li>\n<li>To ensure processes are in place to monitor and evaluate the performance and effectiveness of the College against the plans and approved key performance indicators, which should be, where possible and appropriate, benchmarked against other comparable institutions.<\/li>\n<li>To establish processes to monitor and evaluate the performance and effectiveness of the Board itself as the governing body of the College including in respect of and for the appointment and termination of governors.<\/li>\n<li>To conduct its business in accordance with good practice in higher education corporate governance and with the principles of public life drawn up by the Committee on Standards in Public Life (selflessness, integrity, objectivity, accountability, openness, honesty and leadership).<\/li>\n<li>To safeguard the good name and values of the College.<\/li>\n<li>To appoint the Principal, as Chief Executive Officer, and to put in place suitable arrangements for monitoring their performance and establishing their remuneration.<\/li>\n<li>To appoint the Clerk to the Board and to ensure that, if the person appointed has managerial responsibilities in the College, there is an appropriate separation in the lines of accountability.<\/li>\n<li>To appoint any other ‘senior’ staff as may from time to time be determined, and to agree the level of remuneration and other payments.<\/li>\n<li>To be the employing authority for all staff in the institution and to be responsible for employment policy, including such provision as it thinks fit for the general welfare of staff and the promotion of diversity, equality, and inclusion.<\/li>\n<li>To be the principal financial and business authority of the institution, to ensure that proper books of account are kept, to approve the annual budget and financial statements, and to have overall responsibility for the College’s assets, property, and estate.<\/li>\n<li>To be the College’s legal authority and, as such, to ensure that systems are in place for meeting all the College’s legal obligations, including those arising from contracts and other legal commitments made in the College’s name.<\/li>\n<li>To ensure that processes are established to maintain the College&#8217;s legal and regulatory compliance.<\/li>\n<li>To make such provision as it thinks fit for the general welfare of students, in consultation with the Academic Board, and the promotion of equality, diversity, and inclusion, and to receive assurance that adequate provision has been made for the general welfare of students.<\/li>\n<li>To act as trustee of the College where necessary, and in that role ensuring that processes are in place to comply with all relevant requirements.<\/li>\n<li>To ensure that the College’s Articles of Association are followed at all times and that appropriate advice is available to enable this to happen.<\/li>\n<li>To consider the effectiveness and appropriateness of the Articles of Association and make recommendations for change as necessary.<\/li>\n<li>To appoint the Audit Committee; consider and, where necessary, act on the annual report from the Audit Committee; appoint the external auditors; consider the annual report of the internal audit service; and receive and approve the audited annual financial statements (this responsibility to be reserved to the governing body for its collective decision, without delegation).<\/li>\n<li>To inform its funding body of any ‘material adverse’ change in its circumstances and any serious incident which, in the judgement of the accountable officer and the governing body, could have a substantial impact on the interests of the institution and report any reportable event.<\/li>\n<\/ol>\n<h6>Financial Statements<\/h6>\n<p><a href=\"https:\/\/www.rcl.ac.uk\/wp-content\/uploads\/2021\/02\/annual-report-and-financial-statements-year-ended-31July-2020.pdf\" target=\"_blank\" rel=\"noopener\">RTC Education Ltd Annual Report and Financial Statements Year Ended 31 July 2020<\/a><\/p>\n<h6>Minutes of previous meetings<\/h6>\n<p><a href=\"https:\/\/www.rcl.ac.uk\/wp-content\/uploads\/2020\/10\/board_minutes_15july2020.pdf\" target=\"_blank\" rel=\"noopener\">Minutes of the meeting on 15th July 2020<\/a><\/p><\/div>\n\n\t\t\t            \t<div class=\"bottom-row__sidebar side-cards\">\n\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\n\n\n\n\n\n\n<\/div>\n\n\n<div id=\"general-content-block_5eeb3f2b6a373\" class=\"web-block general-content\">\n\n\n\n\n\n\n\n\n\t    <div class=\"rich-text top-row\">\n\t\t\t\t\n\t\t\t\t\t            \t<h3>Audit and Risk Committee<\/h3>\n\t\t\t\t\t    <\/div>\n\n\n\n\n\n\n\n\t\t<div class=\"bottom-row  bottom-row--have-sidebar\">\n\t        <div class=\"bottom-row__inner rich-text\"><h6>Purpose:<\/h6>\n<p>The duties of the Committee shall be to:<\/p>\n<ol>\n<li>Advise the governing body on the appointment of the external auditors, the audit fee, the provision of any non-audit services by the external auditors, and any questions of resignation or dismissal of the external auditors.<\/li>\n<li>Discuss with the external auditors, before the audit begins, the nature and scope of the audit.<\/li>\n<li>Discuss with the external auditors problems and reservations arising from the interim and final audits, including a review of the management letter, incorporating management responses, and any other matters the external auditors may wish to discuss (in the absence of management where necessary).<\/li>\n<li>Consider and advise the governing body on the appointment and terms of engagement of the internal audit service (and the head of internal audit if applicable), the audit fee, the provision of any non-audit services by the internal auditors, and any questions of resignation or dismissal of the internal auditors. e) Review the internal auditors’ audit risk assessment, strategy and programme; consider major findings of internal audit investigations and management response; and promote coordination between the internal and external auditors. The Committee will ensure that the resources made available for internal audit are enough to meet the institution’s needs (or make a recommendation to the governing body as appropriate).<\/li>\n<li>Keep under review the effectiveness of the risk management, culture, control and governance arrangements and review the external auditors’ management letter, the internal auditors’ annual report and management responses.<\/li>\n<li>Monitor the implementation of agreed audit-based recommendations from whatever source.<\/li>\n<li>Ensure that all significant losses have been thoroughly investigated and that the internal and external auditors – and where appropriate the regulator – have been informed.<\/li>\n<li>Oversee the institution’s policy on fraud and irregularity, including being notified of any action taken under that policy.<\/li>\n<li>Satisfy itself that suitable arrangements are in place to ensure the sustainability of the institution and to promote economy, efficiency and effectiveness. This may include consideration of arrangements that: a) support the culture and behaviour that is prevalent within the institution; b) ensure the effective management of conflicts of interest; and c) enable the appointment of ‘fit and proper persons’ to the governing body and senior executive positions.<\/li>\n<li>Satisfy itself that effective arrangements are in place to ensure appropriate and accurate data returns are made to external stakeholders and regulatory bodies.<\/li>\n<li>Receive any relevant reports from the National Audit Office and its equivalents in Scotland, Wales and Northern Ireland, the regulator and other organisations.<br \/>\nMonitor annually the performance and effectiveness of the external and internal auditors, including any matters affecting their objectivity, and make recommendations to the governing body concerning their reappointment, where appropriate.<\/li>\n<li>Monitor other relevant sources of assurance, for example other external reviews.<\/li>\n<li>Consider elements of the annual financial statements in the presence of the external auditors, including the auditors’ formal opinion, the statement of members’ responsibilities and the statement of internal control, in accordance with the regulator’s accounts directions.<\/li>\n<li>In the event of the merger or dissolution of the institution, ensure that the necessary actions are completed, including arranging for a final set of financial statements to be completed and signed.<\/li>\n<\/ol>\n<h6>Membership<\/h6>\n<p>• The members of the Audit and Risk Committee will be at least 3 independent governors<br \/>\n• The majority of members of the Audit and Risk Committee will be independent and all members will be appointed by the Board of Governors.<br \/>\n• The Chair of the governing body and Chair of the Finance Committee will not be members of the Audit Committee.<\/p><\/div>\n\n\t\t\t            \t<div class=\"bottom-row__sidebar side-cards\">\n\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\n\n\n\n\n\n\n<\/div>\n\n\n<div id=\"general-content-block_5eeba7349dc10\" class=\"web-block general-content\">\n\n\n\n\n\n\n\n\n\t    <div class=\"rich-text top-row\">\n\t\t\t\t\n\t\t\t\t\t            \t<h3>Finance Committee<\/h3>\n\t\t\t\t\t    <\/div>\n\n\n\n\n\n\n\n\t\t<div class=\"bottom-row  bottom-row--have-sidebar\">\n\t        <div class=\"bottom-row__inner rich-text\"><h6>Purpose:<\/h6>\n<p>The duties of the Committee shall be to:<\/p>\n<ol>\n<li>Consider the annual operating budget and recommend its approval to the Board of Governors;<\/li>\n<li>Monitor and review the current and projected levels of income and expenditure across individual areas of RTC Education Ltd;<\/li>\n<li>Review RTC Education Ltd.’s finance strategy on at least annually and recommend its approval to the Board of Governors;<\/li>\n<li>Confirm, if appropriate, to the Board of Governors that it is satisfied that the annual report is an appropriate and reasonable representation of the financial position of RTC<\/li>\n<li>Education Ltd for the year and that the narrative in the introduction is appropriate and consistent with RTC Education Ltd.’s financial position and strategy;<\/li>\n<li>Receive and consider reports from the external auditors relating to the annual financial statements;<\/li>\n<li>Monitor the RTC Education Ltd.’s cash flow performance, forecasts and overall liquidity position;<\/li>\n<li>Consider material financial risks and monitor the financial sustainability of RTC Education Ltd;<\/li>\n<li>Prepare and submit financial statements to Companies House, and other external authorities, if required to do so and approved by the Board of Governors;<\/li>\n<li>Monitor and review expenditure on a regular basis and ensure compliance with the overall financial plan of RTC Education Ltd, and drawing any matters of concern to the attention of the Board of Governors;<\/li>\n<li>Advise the Board of Governors on the appointment of the external auditors, the audit fee, the provision of any non-audit services by the external auditors, and any questions of resignation or dismissal of the external auditors;<\/li>\n<li>Discuss with the external auditors, before the audit begins, the nature and scope of the audit;<\/li>\n<li>Discuss with the external auditors problems and reservations arising from the interim and final audits, including a review of the management letter, incorporating management responses, the external auditor’s opinion on whether public grant funding (if any) has been used for the purposes intended, and any other matters the external auditors may wish to discuss (in the absence of management where necessary);<\/li>\n<li>Ensure public funds (if any) are managed appropriately, in line with the conditions of grant and the principles of regularity, propriety and value for money, and to protect the interests of taxpayers and other stakeholders;<\/li>\n<li>Consider and advise the Board of Governors on the appointment and terms of engagement of the internal audit (and the head of internal audit if applicable}, the audit fee, the provision of any non-audit services by the internal auditors, and any questions of resignation or dismissal of the internal auditors;<\/li>\n<li>Review the internal auditors&#8217; audit risk assessment, strategy and programme; consider major findings of internal audit investigations and management&#8217;s response; and promote co-ordination between the internal and external auditors. The committee will ensure that the resources made available for internal audit are sufficient to meet RTC Education Ltd.’s needs (or make a recommendation to the governing body as appropriate);<\/li>\n<li>Require an annual report by the internal auditors offering clear opinions on risk management, control, governance and value for money;<\/li>\n<li>Review RTC Education Ltd.’s corporate risk register, keep under review the effectiveness of the risk management, control and governance arrangements, and in particular review the external auditors&#8217; management letter, the internal auditors&#8217; annual report, and management responses to major findings of internal investigations;<\/li>\n<li>Monitor the implementation of agreed audit-based recommendations, from whatever source;<\/li>\n<li>Ensure that all significant losses have been properly investigated and that the internal and external auditors have been informed;<\/li>\n<li>Keep under review RTC Education Ltd.’s policy and procedures for detecting fraud and irregularity, including being notified of any action taken under that policy;<\/li>\n<li>Keep under review RTC Education Ltd.’s policy and procedures for the prevention of bribery and receive reports on non-compliance;<\/li>\n<li>Review regular reports from the Money Laundering reporting Officer and the adequacy and effectiveness of RTC Education Ltd.’s anti-money laundering systems and controls;<\/li>\n<li>Review regular reports from the compliance officer and keep under review the adequacy and effectiveness of RTC Education Ltd.’s compliance function;<\/li>\n<li>Satisfy itself that suitable arrangements are in place to promote economy, efficiency and effectiveness;<\/li>\n<li>Monitor annually the performance and effectiveness of the external and internal auditors, including any matters affecting their objectivity, and make recommendations to the governing body concerning their reappointment, where appropriate;<\/li>\n<li>Consider elements of the annual financial statements in the presence of the external auditors, including the auditors&#8217; formal opinion;<\/li>\n<li>In the event of the merger or dissolution of RTC Education Ltd, to ensure that the necessary actions are completed, including arranging for a final set of financial statements to be completed and signed.<\/li>\n<li>Consider significant accounting policies, any changes to them and any significant estimates and judgements;<\/li>\n<li>Consider the methods used to account for significant or unusual transactions where different approaches are possible;<\/li>\n<li>Where the accounting treatment is open to different approaches, to consider whether RTC Education Ltd has adopted appropriate accounting standards and, where necessary, made appropriate estimates and judgements taking into account the views of the external auditor;<\/li>\n<li>Review the clarity and completeness of disclosures in the financial reports and statements and consider whether the disclosures made are set properly in context;<\/li>\n<li>Review any material information presented with the financial statements, (insofar as it relates to the audit and risk management);<\/li>\n<li>Gain assurance on RTC Education Ltd.’s management and quality of data submitted to Higher Education Statistics Agency (HESA), the Student Loans Company (SLC), the Office for Students (OfS), Research England and any other relevant external organisations;<\/li>\n<li>Report on the adequacy and effectiveness of RTC Education Ltd.’s arrangements for the management and quality assurance of data submitted to HESA, SLC, OfS and any other relevant external organisations;<\/li>\n<li>Manage and assure the quality of RTC Education Ltd.’s data, particularly as these relate to returns to external organisations;<\/li>\n<li>Receive, review and report to the Board of Governors on any relevant reports or correspondence from external organisations which are relevant to the Committee&#8217;s primary aims;<\/li>\n<li>Receive and review the minutes and any reports of its sub-committees;<\/li>\n<li>Provide copies of its minutes and an annual report to the Board of Governors; and<\/li>\n<li>Review its terms of reference, composition and effectiveness.<\/li>\n<\/ol>\n<h6>Membership<\/h6>\n<ul>\n<li>The members of the Finance Committee will be:\n<ul>\n<li>at least two independent governors<\/li>\n<li>Principal \/CEO<\/li>\n<\/ul>\n<\/li>\n<\/ul><\/div>\n\n\t\t\t            \t<div class=\"bottom-row__sidebar side-cards\">\n\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\n\n\n\n\n\n\n<\/div>\n\n\n<div id=\"general-content-block_5eeba75b9dc11\" class=\"web-block general-content\">\n\n\n\n\n\n\n\n\n\t    <div class=\"rich-text top-row\">\n\t\t\t\t\n\t\t\t\t\t            \t<h3>Nominations and Remuneration Committee<\/h3>\n\t\t\t\t\t    <\/div>\n\n\n\n\n\n\n\n\t\t<div class=\"bottom-row  bottom-row--have-sidebar\">\n\t        <div class=\"bottom-row__inner rich-text\"><h6>Purpose:<\/h6>\n<p>The duties of the Committee shall be to:<\/p>\n<ol>\n<li>to advise the Board of Governors on the framework and policy for the nominations of and remuneration for the governors, chairs and any other such members of the senior management as it is designated to consider (no person may be involved in any decision as to their own remuneration);<\/li>\n<li>to review the ongoing appropriateness and relevance of the nominations and remuneration policy, taking into account any relevant legal requirements;<\/li>\n<li>to advise the Board of Governors on the appointment and re-appointment of individuals as governors (including independent governors), chairs or any other such members of the senior management of RTC Education Ltd;<\/li>\n<li>to advise the Board of Governors on the terms of office of governors, independent governors, chairs or any other such members of the senior management of RTC Education Ltd;<\/li>\n<li>to advise the Board of Governors on the design of, and determine targets for, any performance related pay schemes operated by RTC Education Ltd and approve the total annual payments made under such schemes;<\/li>\n<li>to advise the Board of Governors on the policy for, and scope of, pension arrangements for each of the governors and other senior officers of RTC Education Ltd;<\/li>\n<li>to ensure that contractual terms on termination, and any payments made, are fair to the individual and RTC Education Ltd, that failure is not rewarded and that the duty to mitigate loss is fully recognised;<\/li>\n<li>within the terms of the agreed policy and in consultation with the Board of Governors, to advise the Board of Governors on the total individual remuneration packages for each governor and senior manager including bonuses and incentive payments;<\/li>\n<li>to review and note annually the nomination and remuneration trends across RTC Education Ltd;<\/li>\n<li>to oversee any major changes in employee benefits structures across RTC Education Ltd;<\/li>\n<li>to review and advise the Board of Governors on the policy for authorising claims for expenses from the governors and from the chairs;<\/li>\n<li>to ensure that all provisions regarding disclosure or remuneration, including pensions, are fulfilled;<\/li>\n<li>to be exclusively responsible for establishing selection criteria, appointing and setting terms of reference for any remuneration for consultants who advise the committee;<\/li>\n<li>to obtain reliable up to date information about nominations and remuneration in other similar institutions;<\/li>\n<li>to receive, review and report to the Board of Governors on any relevant reports or correspondence from external organisations which are relevant to the Committee&#8217;s primary aims;<\/li>\n<li>to receive and review the minutes and any reports of its sub-committees;<\/li>\n<li>to provide copies of its minutes and an annual report to the Board of Governors; and<\/li>\n<li>to review its terms of reference, composition and effectiveness.<\/li>\n<\/ol>\n<h6>Membership<\/h6>\n<ul class=\"ul_list tick\">\n<li>The members of the Nominations &amp; Remuneration Committee will be:\n<ul class=\"ul_list tick\">\n<li>at least two independent governors<\/li>\n<li>Principal \/CEO<\/li>\n<\/ul>\n<\/li>\n<\/ul><\/div>\n\n\t\t\t            \t<div class=\"bottom-row__sidebar side-cards\">\n\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\n\n\n\n\n\n\n<\/div>\n\n\n<div id=\"general-content-block_5ef4bcf55418d\" class=\"web-block general-content\">\n\n\n\n\n\n\n\n\n\t    <div class=\"rich-text top-row\">\n\t\t\t\t\n\t\t\t\t\t            \t<h3>Advisory Panel<\/h3>\n\t\t\t\t\t    <\/div>\n\n\n\n\n\n\n\n\t\t<div class=\"bottom-row  bottom-row--have-sidebar\">\n\t        <div class=\"bottom-row__inner rich-text\"><p>The Board of Governors acknowledge the immense benefit that external perspective, insight, experience and challenge can bring and therefore are supported in their role by an Advisory Panel.<\/p>\n<p>The Advisory Panel shall provide advice and guidance to the Principal and the Board of Governors relating to:<\/p>\n<ul>\n<li>Developing the educational charter and mission of RCL\/RHU<\/li>\n<li>Developing the strategic direction and policy of RCL\/RHU<\/li>\n<li>Enhancing the quality of teaching and learning, graduate outcomes and student satisfaction<\/li>\n<li>Identifying new areas for development and innovation<\/li>\n<\/ul><\/div>\n\n\t\t\t            \t<div class=\"bottom-row__sidebar side-cards\">\n\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\n\n\n\n\n\n\n<\/div>\n\n\n<div id=\"general-content-block_5ef4bd8a5418f\" class=\"web-block general-content\">\n\n\n\n\n\n\n\n\n\t    <div class=\"rich-text top-row\">\n\t\t\t\t\n\t\t\t\t\t            \t<h3>Membership<\/h3>\n\t\t\t\t\t    <\/div>\n\n\n\n\n\n\n\n\t\t<div class=\"bottom-row  bottom-row--have-sidebar\">\n\t        <div class=\"bottom-row__inner rich-text\"><div class=\"alignleft imageborder\">\n<h6>Prof George Holmes, Chair<\/h6>\n<p><img class=\"alignleft size-full wp-image-89077\" src=\"https:\/\/www.rcl.ac.uk\/wp-content\/uploads\/2021\/01\/George-Holmes.png\" alt=\"Prof George Holmes\" width=\"200\" height=\"200\" srcset=\"https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/George-Holmes.png 200w,   https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/George-Holmes-150x150.png 150w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/p>\n<p>When appointed to the post of Vice Chancellor and Chief Executive of the university in 2005, George became the youngest university head in the UK. He has been at the university now for over thirteen years. He holds a Doctorate in the field of Education, a Masters in Business Administration and a BSc in Economics. Professor Holmes is also a Fellow of the Institute of Directors.<\/p>\n<p>He previously edited two International Journals for almost ten years, specialising in Quality Assurance in Education. In 2002 he was appointed by the then Secretary of State for Education and Skills as advisor to the Department, becoming, along with Sir Ron Cooke, one of only two Sector representatives for the Department’s HE Policy Delivery Steering Group – which was assisting in the preparation of the HE White Paper. George was, for six years until 2014, on the Board of the Octagon Theatre, Bolton, and is now on the Board of the Bolton Lads and Girls Club. He was previously a Governor of Bolton School, the ESSA Academy Trust and Bury College. He is a founding Trustee of the Bolton University Technical College, and a Governor at Bolton College. Prior to joining the university, Dr Holmes was Principal of Doncaster College where he also established the Doncaster Education City Project, of which he became Chief Executive. In this post he secured the largest capital grant in the history of the FE sector at the time and had responsibility for building a new £75m College on the Waterfront. At Doncaster he was a Governor of both the College and Hayfield School. George was previously Deputy Vice Chancellor at the University of North London (now the London Metropolitan University). In 1996 he played a central role, within the Vice Chancellor’s Office, in the founding of the Lincoln University Campus, opened by HM The Queen. Latterly in 2015, Professor Holmes was appointed by Her Majesty’s Lord Lieutenant of the County of Greater Manchester as one of his Deputy Lieutenants.<\/p>\n<h6>Ian Baker<\/h6>\n<\/div>\n<p style=\"clear: both;\"><img class=\"size-full wp-image-89078 alignleft\" src=\"https:\/\/www.rcl.ac.uk\/wp-content\/uploads\/2021\/01\/Ian-Baker.png\" alt=\"Ian Baker\" width=\"200\" height=\"200\" srcset=\"https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Ian-Baker.png 200w,   https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Ian-Baker-150x150.png 150w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/p>\n<p>Ian holds the position of Partner (Finance) and a member of the Executive Committee at Rockspring Property Investment Managers LLP (Rockspring). His primary responsibilities are the strategic planning aspects as they pertain to finance, including the planning and implementation of the corporate, financial, tax and debt structures for all client funds, asset acquisitions and disposals.<\/p>\n<p>Ian is also the Rockspring Compliance Officer. Ian commenced his professional career in the London office of international chartered accountants Peat Marwick. In 1987 Ian joined INVESCO MIM and part of his responsibilities was the financial control and tax planning of the PanEuropean Property Unit Trust. In 1990 Ian became a full time member of MIM Property Services Limited (MIMPS) with responsibility for all accounting, fund structuring, debt finance and tax planning. In 1993 MIMPS was acquired by the Prudential Insurance Company of America and changed its name to PRICOA Property Investment Management Limited (PPIM). Ian was responsible for the fund structuring, debt financing and tax planning of client funds. Ian has structured acquisitions in 14 countries in Europe. In 2004 PPIM was subject to a management buy-out, and changed its name to Rockspring. Ian is among the Founder Shareholders. Ian holds a BA in Accountancy from the University of Kent at Canterbury and has been a member of the Institute of Chartered Accountants in England and Wales since 1985.<\/p>\n<h6>Lord Rami Ranger CBE<\/h6>\n<p style=\"clear: both;\"><img class=\"alignleft size-full wp-image-89079\" src=\"https:\/\/www.rcl.ac.uk\/wp-content\/uploads\/2021\/01\/Rami-Ranger.png\" alt=\"Lord Rami Ranger CBE\" width=\"200\" height=\"200\" srcset=\"https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Rami-Ranger.png 200w,   https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Rami-Ranger-150x150.png 150w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/p>\n<h6><\/h6>\n<p>Lord Rami Ranger CBE, FRSA is a successful businessman who has been honoured by Her Majesty the Queen on Eight occasions. Six times for Business and twice personally for community services and was made a Member of British Empire in 2005 and Commander of British Empire in 2016. Rami is married to Renu and has three daughters.<\/p>\n<p>Rami set up his first business in 1987 with a mere 2 pounds capital from a rented room in Hayes and through his sheer dedication and commitment, he now runs two of Britain’s fastest growing companies with an annual turnover in excess of £200 million. He sustains thousands of British jobs by exporting British supermarket products to over 130 countries.<\/p>\n<p>His company, Sun Mark Ltd, has received from Her Majesty the Queen, the Queens Award for Enterprise for an unprecedented 5 consecutive years in 2009, 2010, 2011, 2012 and 2013, and in the process made British business history as no other company has received this accolade before. Sun Mark has been added to the Sunday Times most profitable 100 companies in Britain in their “Profit Track 100” league table for the past three years running. Rami won the prestigious Institute of Director’s the Director of the Year Award for 2013 and European Export Champion in 2014. Rami also devotes his time to benefitting society by launching ground breaking initiatives designed to strengthen social cohesion in Britain. He Co-Founded of the British Asian Conservative Link and served the organisation for over a decade as its General Secretary. He works hard to make British Asians more politically and publically spirited. Due to the work done by the BACL, there are now 5 Conservative Members of Parliament of Asian origin where there were none before. The Prime Minister the Rt. Hon. Theresa May MP in January 2018 appointed him the Co Chairman of the Conservative Friends of India to champion bilateral relationship between Britain and India. He is a Fellow of the Princes Trust and works tirelessly to enable The Prince’s Trust to reach even more of our youth to pass on his experience and expertise in inspiring the next generation of entrepreneurs. His message is that one does not need a rich family or an elite education to succeed in life. However, one needs self-respect, good work ethics, commitment and empathy for others. Rami believes in supporting education and helping to provide better facilities for students. He has a clear message on this and says that if it had not been for his mother being an educated woman, he would not be where he is today. To support this he donated £250,000 to London South Bank University to set up a fund for Enterprise Excellence and to establish the Lord Rami Ranger CBE Centre for Graduate Entrepreneurship which provides a hub and workspace for students and graduates on enterprise programmes. The centre was opened by The Rt. Hon. Theresa Villiers, Secretary of State for Northern Ireland. Please click on the link to view video <a href=\"https:\/\/www.youtube.com\/watch?v=qziYI5dcuDA\" target=\"_blank\" rel=\"noopener noreferrer\">https:\/\/www.youtube.com\/watch?v=qziYI5dcuDA<\/a> He has donated £200,000 to the University of West London towards a new group pavilion in the campus library and for student hostel to enhance the facilities for the university students. Rami donated £100,000 to the Gandhi Memorial Foundation Trust which is raising funds to erect a statue of Mahatma Gandhi in Parliament Square, London. Rami was quoted as saying “The world owes Gandhi Ji a huge debt of gratitude for liberating one fifth of mankind through non-violence thereby creating a better world”.<\/p>\n<h6>Richard Resch<\/h6>\n<p><img class=\"alignleft size-full wp-image-89080\" src=\"https:\/\/www.rcl.ac.uk\/wp-content\/uploads\/2021\/01\/Richard-Resch.png\" alt=\"Richard Resch\" width=\"200\" height=\"200\" srcset=\"https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Richard-Resch.png 200w,   https:\/\/3arol9bs7qh145m57r5fbq9p-wpengine.netdna-ssl.com\/wp-content\/uploads\/2021\/01\/Richard-Resch-150x150.png 150w\" sizes=\"(max-width: 200px) 100vw, 200px\" \/><\/p>\n<p>Richard Resch is a leading international educator with over forty years of successful higher education experience, in the USA and abroad including culturally diverse settings in Italy, the US Virgin Islands, Brazil and England, involving trusteeship, US and transnational accreditation, assessment of institutional effectiveness and student learning outcomes, strategic planning, teaching, curriculum and program development, financial management, resource development and grant-writing, facilities and infrastructure planning, and personnel development.<\/p>\n<p>He has held appointments as a tenured faculty member, administrator, dean, provost, and trustee at the University of The Virgin Islands; Universidade Federal de Goias – Brazil; The College of Staten Island-City University of New York; Richmond, The American International University In London; Dowling College (NY); The American University of Rome (Italy); and University of the Potomac (Washington, DC), serving as Provost at the last four. He has been a member of the Board of Trustees of Richmond since 2016, serving as its Chair during 2019-2020.<\/p>\n<p>Dr. Resch holds a Ph.D. from the University of Connecticut, an M.A. from the Pennsylvania State University and a B.S. from Union College (Schenectady, New York) all in mathematics; he attended the Institute for Educational Management at the Graduate School of Education, Harvard University; and holds an honorary Doctor of Science degree from Richmond, The American International University in London.<\/p>\n<h4><strong> External Advisors<\/strong><\/h4>\n<ul class=\"ul_list tick\">\n<li>Patrick McGhee, Assistant Vice Chancellor, University of Bolton<\/li>\n<\/ul>\n<p>Patrick sits as the Independent Chair of the RCL Quality Committee.<\/p>\n<div class=\"space20\"><\/div>\n<div class=\"clear\"><\/div><\/div>\n\n\t\t\t            \t<div class=\"bottom-row__sidebar side-cards\">\n\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\n\n\n\n\n\n\n<\/div>","protected":false},"excerpt":{"rendered":"","protected":false},"author":2,"featured_media":1484,"parent":199,"menu_order":7,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v14.4.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Governance and External Expertise - Regent College London<\/title>\n<meta name=\"description\" content=\"The Board of Governors of Regent College London are the College’s directors, Dr Selva Pankaj, Mrs Tharshiny Pankaj and Dr Maurizio Bragagni. Dr Selva Pankaj also acts as the College Principal.\" \/>\n<meta name=\"robots\" content=\"index, follow\" \/>\n<meta name=\"googlebot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<meta name=\"bingbot\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.rcl.ac.uk\/our-college\/governance-and-external-expertise\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Governance and External Expertise - Regent College London\" \/>\n<meta property=\"og:description\" content=\"The Board of Governors of Regent College London are the College’s directors, Dr Selva Pankaj, Mrs Tharshiny Pankaj and Dr Maurizio Bragagni. Dr Selva Pankaj also acts as the College Principal.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.rcl.ac.uk\/our-college\/governance-and-external-expertise\/\" \/>\n<meta property=\"og:site_name\" content=\"Regent College London\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/RegentCollegeHE\/\" \/>\n<meta property=\"article:modified_time\" content=\"2021-02-23T15:42:40+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.rcl.ac.uk\/wp-content\/uploads\/2020\/07\/AboutUs-OurExpertise-RLCPhoto455-scaled.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"1707\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@RegentCollegeHE\" \/>\n<meta name=\"twitter:site\" content=\"@RegentCollegeHE\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.rcl.ac.uk\/#website\",\"url\":\"https:\/\/www.rcl.ac.uk\/\",\"name\":\"Regent College London\",\"description\":\"HND Courses, Foundation Year, Top-Up and Bachelor Degrees\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/www.rcl.ac.uk\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.rcl.ac.uk\/our-college\/governance-and-external-expertise\/#primaryimage\",\"inLanguage\":\"en-GB\",\"url\":\"https:\/\/www.rcl.ac.uk\/wp-content\/uploads\/2020\/07\/AboutUs-OurExpertise-RLCPhoto455-scaled.jpg\",\"width\":2560,\"height\":1707},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.rcl.ac.uk\/our-college\/governance-and-external-expertise\/#webpage\",\"url\":\"https:\/\/www.rcl.ac.uk\/our-college\/governance-and-external-expertise\/\",\"name\":\"Governance and External Expertise - Regent College London\",\"isPartOf\":{\"@id\":\"https:\/\/www.rcl.ac.uk\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.rcl.ac.uk\/our-college\/governance-and-external-expertise\/#primaryimage\"},\"datePublished\":\"2020-06-05T09:14:26+00:00\",\"dateModified\":\"2021-02-23T15:42:40+00:00\",\"description\":\"The Board of Governors of Regent College London are the College\\u2019s directors, Dr Selva Pankaj, Mrs Tharshiny Pankaj and Dr Maurizio Bragagni. Dr Selva Pankaj also acts as the College Principal.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.rcl.ac.uk\/our-college\/governance-and-external-expertise\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.rcl.ac.uk\/our-college\/governance-and-external-expertise\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.rcl.ac.uk\/our-college\/governance-and-external-expertise\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.rcl.ac.uk\/\",\"url\":\"https:\/\/www.rcl.ac.uk\/\",\"name\":\"Home\"}},{\"@type\":\"ListItem\",\"position\":2,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.rcl.ac.uk\/our-college\/\",\"url\":\"https:\/\/www.rcl.ac.uk\/our-college\/\",\"name\":\"Our College\"}},{\"@type\":\"ListItem\",\"position\":3,\"item\":{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.rcl.ac.uk\/our-college\/governance-and-external-expertise\/\",\"url\":\"https:\/\/www.rcl.ac.uk\/our-college\/governance-and-external-expertise\/\",\"name\":\"Governance and External Expertise\"}}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","_links":{"self":[{"href":"https:\/\/www.rcl.ac.uk\/wp-json\/wp\/v2\/pages\/207"}],"collection":[{"href":"https:\/\/www.rcl.ac.uk\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.rcl.ac.uk\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.rcl.ac.uk\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.rcl.ac.uk\/wp-json\/wp\/v2\/comments?post=207"}],"version-history":[{"count":0,"href":"https:\/\/www.rcl.ac.uk\/wp-json\/wp\/v2\/pages\/207\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.rcl.ac.uk\/wp-json\/wp\/v2\/pages\/199"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.rcl.ac.uk\/wp-json\/wp\/v2\/media\/1484"}],"wp:attachment":[{"href":"https:\/\/www.rcl.ac.uk\/wp-json\/wp\/v2\/media?parent=207"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}